import os
from tkinter import filedialog as fd
from pdf.generator import DocGenerator


def open_pdf(file_path):
    print("Открываем:", file_path)
    print("Файл существует:", os.path.exists(file_path))

    if os.path.exists(file_path):
        os.startfile(file_path)
    else:
        print("PDF НЕ НАЙДЕН")

def createInvoiceDoc():
    path = f"{fd.askdirectory()}/{"test"}" 
    doc = DocGenerator(path=path)

    doc.add_text(x=205, y=770, text="ДОГОВОР ПОСТАВКИ № _____", font="LiberationSerif-Bold", font_size=14)
    doc.add_text(x=70, y=750, text="г. Бишкек", font="LiberationSerif", font_size=12)
    doc.add_text(x=420, y=750, text="«___» __________ 2026 г.", font="LiberationSerif", font_size=12)
    doc.add_text(x=70, y=720, text=f"\b\b\bИП Алапаев Адилет Абдыкадырович, именуемый в дальнейшем «Поставщик», действующий на основании Свидетельства о Государственной Регистрации Индивидуального предпринимателя, с одной стороны, {"organization name"}, именуемый в дальнейшем «Покупатель», в лице директора {"director full name"}, действующего на основании {"POLOJENIA/USTAVA"}, с другой стороны, именуемые вместе как «Стороны», заключили настоящий договор о ниже следующем:", font="LiberationSerif", font_size=12, text_area_width=490)
    doc.add_text(x=70, y=620, text="1. ПРЕДМЕТ И СУММА ДОГОВОРА", font="LiberationSerif-Bold", font_size=12)
    doc.add_text(x=70, y=600, text="\b\b\b1.1. Поставщик обязуется выполнять поставку оборудования, а также расходных материалов для данного оборудования по заказу Покупателя согласно Приложению №1, в соответствии с условиями настоящего договора, Покупатель обязуется принять и оплатить согласно Счета на оплату.", font="LiberationSerif", font_size=12)
    doc.add_text(x=70, y=535, text="\b\b\b1.2. Количество, развернутая номенклатура (ассортимент) согласовывается при оформлении конкретного заказа.", font="LiberationSerif", font_size=12)
    doc.add_text(x=70, y=500, text=f"\b\b\b1.3. Общая сумма настоящего договора составляет {"sum"}({"sumWord"})сом 00 тыйын согласно Приложению №1, являющемуся неотъемлемой частью настоящего договора.", font="LiberationSerif", font_size=12)
    doc.add_text(x=70, y=460, text="2. КАЧЕСТВО И ГАРАНТИИ", font="LiberationSerif-Bold", font_size=12)
    doc.add_text(x=70, y=440, text="\b\b\b2.1. Качество доставленного оборудования должно соответствовать условиям договора.", font="LiberationSerif", font_size=12)
    doc.add_text(x=70, y=415, text="\b\b\b2.2. Гарантийный срок оборудования обговаривается для каждого товара отдельно, исчисляется с момента приемки оборудования Заказчиком.", font="LiberationSerif", font_size=12)
    doc.add_text(x=70, y=380, text="\b\b\b2.3. Заказчик обязан соблюдать правила эксплуатации и хранения оборудования.", font="LiberationSerif", font_size=12)
    doc.add_text(x=70, y=340, text="3. ПРАВА И ОБЯЗАННОСТИ СТОРОН", font="LiberationSerif-Bold", font_size=12)
    doc.add_text(x=70, y=320, text="\b\b\b3.1. Поставщик обязан передать Покупателю оборудование в требуемом количестве, которое согласуется с Покупателем, транспортировка товара до места назначения надлежащего качества в требуемом осуществляется за счет Покупателя.", font="LiberationSerif", font_size=12)
    doc.add_text(x=70, y=270, text="\b\b\b3.2. Срок поставки согласовывается сторонами в заказе.", font="LiberationSerif", font_size=12)
    doc.add_text(x=70, y=250, text="\b\b\b3.3. Поставщик обязан предоставить готовое оборудование Заказчику в течение 3-х рабочих дней с момента уведомления Заказчика о готовности оборудования.", font="LiberationSerif", font_size=12)
    doc.add_text(x=70, y=210, text="\b\b\b3.4. Приемка оборудования оформляется актом приема-передачи, подписанного обеими сторонами. С момента подписания акта приема-передачи Поставщик считается выполнившим все свои обязательства по настоящему договору.", font="LiberationSerif", font_size=12)
    doc.add_text(x=70, y=160, text="\b\b\b3.5. Заказчик обязан осуществить проверку и принять изделия по количеству, качеству и подписать акт приёма-передачи, оплатить согласно пункту 4.1 настоящего договора.", font="LiberationSerif", font_size=12)
    doc.add_text(x=70, y=120, text="\b\b\b3.6. В случае выявления Заказчиком при приемке оборудования несоответствий по качеству, количеству об этом должна быть сделана соответствующая отметка в акте приёма-передачи. Поставщик обязан рассмотреть указанные претензии. В случае признания претензии необоснованной Поставщик в письменном виде отказывает в неудовлетворении.", font="LiberationSerif", font_size=12)
    doc.add_page()
    doc.add_text(x=70, y=770, text="\b\b\b3.7. Если претензии являются обоснованными и оборудование передано Заказчику по качеству, количеству, комплектации, комплектности, несоответствующим условиям договора, Поставщик устраняет недостатки в течение 20-30 рабочих дней с момента предъявления соответствующих требований. Гарантийный талон в этом случае выдается Заказчику после устранения недостатков.", font="LiberationSerif", font_size=12)
    doc.add_text(x=70, y=680, text="4. ЦЕНА И ПОРЯДОК РАСЧЕТОВ", font="LiberationSerif-Bold", font_size=12)
    doc.add_text(x=70, y=660, text="\b\b\b4.1. Цена на поставляемую по настоящему договору Продукцию (в соответствии с заказом Покупателя) определяется исходя из прайс-листа Поставщика, действующего на момент передачи Продукции, указывается в накладных и счетах-фактурах.", font="LiberationSerif", font_size=12)
    doc.add_text(x=70, y=610, text="\b\b\b4.2. Расчёт за поставляемую по настоящему договору Продукцию осуществляется Покупателем на 100% оплаты до осуществления поставки путем перечисления денежных средств на расчетный счет Поставщика, либо производит оплату наличным платежом.", font="LiberationSerif", font_size=12)
    doc.add_text(x=70, y=560, text="\b\b\b4.3. Цена товара включает в себя стоимость упаковки, маркировки, документального оформления.", font="LiberationSerif", font_size=12)
    doc.add_text(x=70, y=520, text="5. ОТВЕТСТВЕННОСТЬ СТОРОН", font="LiberationSerif-Bold", font_size=12)
    doc.add_text(x=70, y=500, text="\b\b\b5.1. За неисполнение или ненадлежащее исполнение обязательств по настоящему договору Стороны несут ответственность в соответствии с действующим законодательством КР.", font="LiberationSerif", font_size=12)
    doc.add_text(x=70, y=465, text="\b\b\b5.2. Ни одна из Сторон настоящего договора не несет ответственности перед другой Стороной за невыполнение обязательств, обусловленных обстоятельствами, возникшими помимо воли и желания Сторон, которые нельзя предвидеть или избежать, включая объявленную или фактическую войну, гражданские волнения, эпидемии, блокаду, землетрясения и другие стихийные бедствия.", font="LiberationSerif", font_size=12)
    doc.add_text(x=70, y=385, text="\b\b\b5.3. Документ, выданный соответствующим компетентным органом, является достаточным подтверждением наличия и продолжительности действия непреодолимой силы", font="LiberationSerif", font_size=12)
    doc.add_text(x=70, y=350, text="\b\b\b5.4. Сторона, которая не исполнит своего обязательства вследствие действия непреодолимой силы, должна немедленно известить другую Сторону о препятствии и его влиянии на неисполнение обязательств по договору.", font="LiberationSerif", font_size=12)
    doc.add_text(x=70, y=290, text="6. ЗАКЛЮЧИТЕЛЬНЫЕ ПОЛОЖЕНИЯ", font="LiberationSerif-Bold", font_size=12)
    doc.add_text(x=70, y=270, text=f"\b\b\b6.1. Настоящий договор вступает в силу с момента его подписания Сторонами и действует до {"date day month year"}, а в случае, если к указанному моменту у Сторон остались неисполненные обязательства, вытекающие из настоящего договора, срок действия договора продлевается до полного выполнения Сторонами своих обязательств.", font="LiberationSerif", font_size=12)
    doc.add_text(x=70, y=200, text=f"\b\b\b6.2. Действие настоящего договора будет считаться автоматически пролонгированным на следующий календарный год в случае, если до {"date day month"} текущего года ни одна из Сторон настоящего договора в письменной форме не выразит намерения о его расторжении.", font="LiberationSerif", font_size=12)
    doc.add_text(x=70, y=150, text="\b\b\b6.3. Настоящий договор может быть расторгнут:", font="LiberationSerif", font_size=12)
    doc.add_text(x=70, y=130, text="\b\b\b6.3.1. По соглашению Сторон;", font="LiberationSerif", font_size=12)
    doc.add_text(x=70, y=110, text="\b\b\b6.3.2. В иных предусмотренных законом случаях.", font="LiberationSerif", font_size=12)
    doc.add_text(x=70, y=90, text="\b\b\b6.4. Все изменения и дополнения к настоящему договору ДОЛЖНЫ быть совершены в письменной форме и подписаны полномочными представителями Сторон.", font="LiberationSerif", font_size=12)
    doc.add_page()
    doc.add_text(x=70, y=770, text="\b\b\b6.5. Договор, заключенный посредством электронной почты и других электронных средств сообщения, а равно и все документы, касающиеся исполнения или изменения договора, передаваемые по электронной почте и других электронных средств сообщения, имеют юридическую силу.", font="LiberationSerif", font_size=12)
    doc.add_text(x=70, y=705, text="\b\b\b6.6. Настоящий договор составлен в двух экземплярах на русском языке, имеющих одинаковую юридическую силу.", font="LiberationSerif", font_size=12)
    doc.add_text(x=70, y=670, text="7. ЮРИДИЧЕСКИЕ АДРЕСА, БАНКОВСКИЕ РЕКВИЗИТЫ И ПОДПИСИ СТОРОН", font="LiberationSerif-Bold", font_size=12)
    doc.add_table(x=70, y=650)
    
    
    
    doc.save_page()
    doc.show_page()
    
createInvoiceDoc()
open_pdf("C:/Users/Абиль Абдырахманов/Desktop/Новая папка/test.pdf")

